{
    "version": "https://jsonfeed.org/version/1",
    "title": "Piracy Guide",
    "description": "",
    "home_page_url": "https://www.piracy.guide",
    "feed_url": "https://www.piracy.guide/feed.json",
    "user_comment": "",
    "author": {
        "name": "Admin"
    },
    "items": [
        {
            "id": "https://www.piracy.guide/beginners-guide-to-downloading-torrents/",
            "url": "https://www.piracy.guide/beginners-guide-to-downloading-torrents/",
            "title": "Beginners guide to downloading torrents.",
            "summary": "Hello there! If you're reading this guide then you're probably trying to download something and you need to use a torrent. I've designed this post to give you all the information you need as quick as possible so you can get what you're after. If&hellip;",
            "content_html": "<p>Hello there!  If you're reading this guide then you're probably trying to download something and you need to use a torrent.  I've designed this post to give you all the information you need as quick as possible so you can get what you're after.  If you want to know more in depth information about torrents the  you can read my complete guide which I'll be making soon.</p>\n<p> </p>\n<h2>So let's begin</h2>\n<p>Let's be honest, you're probably downloading something illegally.  We are pirates aftter all.  First thing we need to do is decide if you need to use  VPN or not.   What is a VPN?  Put simply, it hides your internet traffic and makes it so you're essentially untracable as far as copyright goes.  That way if you download the latest movie from a torrent site, you won't get any letters from your ISP saying you've done something Illegal.  </p>\n<p>If you are from the US and you're downloading a public torent, then you probably need to use one.  The good news is, you can get them super cheap.  AirVPN is my personal recommendation. It's super easy to use, and very secure.  (Yes, that link above is a referal link. If you sign up using that link, I get credit from it.  I could've done this with any VPN provider, but I chose AirVPN because it is honestly the best in my opinion.)<br><br></p>\n<h2>Using AirVPN</h2>\n<p>Skip this section if you are torrenting without a VPN, or you're using another provider.</p>\n<p>Activate network lock.</p>\n<p> </p>\n<h2>Installing the torrent software</h2>\n<p>In order to download using a torrent you're going to need a program that can do that.  There are many different torrent clients available, I personally use qBittorrent, but feel free to use another if you prefer.  Other good choices are Transmission, Deluge, and RuTorrent.   <em>Do <span style=\"color: #e03e2d;\">NOT</span> use uTorrent.  </em>uTorrent  is very untrustworthy, as they have bundled cryptominers with their software and other shady things.</p>\n<p>The first step is to download qBittorrent.  Once you have downloaded the file, double click it to start the install.</p>\n<p> </p>\n<p>So now that you have qBittorrent installed, let's go ahead and get your downloaded started. That way you can finish reading this while it's going in the background.  Luckily all you need to do now is either double click the .torrent file you downloaded, or click the magnet link and choose to open it with qBittorrent.<br>When you do, you'll see a popup like this one.<br><br>You just need to chose a download location and click start.  If all goes well, it'll take a few moments to connect to a swarm and find seeders, then it'll start. </p>\n<p>So while your file is downloading, let's learn about what all those words mean, and how torrents work.  To put it simply, there are many computers all over the internet that have the file you are trying to download.  Instead of downloading from a single centralized website, your torrent client is finding all of those people that are sharing that file, and it's downloading from all of them at the same time.  If you are downloading a video, it might download the first part from one person, the second part from a different person, and yet another part from yet another person.</p>\n<p>Of course theres a bit more to it than that, but there are a few benefits to that.  The first one is download speed.  Asumming that a torrent has a lot of seeders. (The people you're downloading from.) you can get a very high download speed. There are a lot of computers sending this file to you at the same time, instead of just one.  Another benefit is that the download will survive much longer.  Because there are so many people to download it from, if a server goes offline or the file is accidentally deleted from somewhere, theres still many other places it can be downloaded from.</p>\n<p>So to get back on track, let's talk about how to seeder and peer system works.  Right now, you are likely downloading a torrent.  This means you are what's called a peer.  A peer is every person interacting with a certain torrent.  There are two types of peers.  The first type is called a leecher.  A leecher is anyone who is currently downloading a torrent. After your torrent is completely done downloading, you'll notice that your torrent client will say \"Seeding\".  That means you've become the second type of peer.  a seeder.  A seeder is anyone who has completely downloaded the torrent, and is now sharing the file to others.</p>\n<p>Torrents are peer-to-peer. This means it's kind of a community effort.  You download the file from all of these people, then once you have the file, other people download it from you. This way everyone helps everyone.</p>\n<p>I've made a small demonstration below of this process, if that helps your understanding.</p>\n<p> </p>\n<p>Most torrent clients track what's called a ratio.  This is a ....ratio... that compare how much you have downloaded from other people, versus how much you have uploaded to others.  It is common curtesy to at least give back an equal amount.  Meaning that if you download a 4.56 gigbyte movie, seed the file until other people have downloaded at least 4.56 gigbytes from you. This would be a ratio of 1.    If you download a 10gb game, and you upload 25gbs back to the community, that would be a ratio of 2.5.</p>\n<p> </p>\n<p>I keep talking about how you're downloading from other people, and uploading to other people.  But how does your client know which people have this file to download from?  That's where trackers come in.  A tracker is a website/service that keeps \"track\" of who has what.</p>",
            "author": {
                "name": "Admin"
            },
            "tags": [
            ],
            "date_published": "2021-10-20T18:31:14-05:00",
            "date_modified": "2021-10-20T18:59:11-05:00"
        }
    ]
}
